In [2]:
import pandas as pd

In [3]:
my_series = pd.Series([3, 1, -3, -5, 0])

In [4]:
my_series

0    3
1    1
2   -3
3   -5
4    0
dtype: int64

In [5]:
my_series[1]

1

In [8]:
my_series[:2]

0    3
1    1
dtype: int64

In [10]:
my_series[my_series >= 0]

0    3
1    1
4    0
dtype: int64

In [11]:
my_series * 2

0     6
1     2
2    -6
3   -10
4     0
dtype: int64

In [12]:
import numpy as np

In [13]:
np.exp(my_series)

0    20.085537
1     2.718282
2     0.049787
3     0.006738
4     1.000000
dtype: float64

In [14]:
np.sum(my_series)

-4

In [26]:
df = pd.DataFrame({
    'name': ['Маша','Вася','Эдуард'],
    'age': [25, 8, 48],
    'job': ['Програмист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
}, index = ['some', 'random', 'words'])

In [27]:
df

          name  age         job  salary
some      Маша   25  Програмист     100
random    Вася    8    Школьник      10
words   Эдуард   48    Big Boss     200

In [28]:
name = df['name']

In [29]:
name

some        Маша
random      Вася
words     Эдуард
Name: name, dtype: object

In [30]:
df[df['salary'] >= 100]

         name  age         job  salary
some     Маша   25  Програмист     100
words  Эдуард   48    Big Boss     200

In [31]:
df['salary'] *= 2

In [32]:
df

          name  age         job  salary
some      Маша   25  Програмист     200
random    Вася    8    Школьник      20
words   Эдуард   48    Big Boss     400

In [33]:
df['salary'] / 2

some      100.0
random     10.0
words     200.0
Name: salary, dtype: float64

In [35]:
df.loc['some':'random']

        name  age         job  salary
some    Маша   25  Програмист     200
random  Вася    8    Школьник      20

In [36]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary          20
Name: random, dtype: object

In [37]:
df.iloc[:1]

      name  age         job  salary
some  Маша   25  Програмист     200

In [38]:
df.T

              some    random     words
name          Маша      Вася    Эдуард
age             25         8        48
job     Програмист  Школьник  Big Boss
salary         200        20       400

In [40]:
df.T.iloc[:2]

      some random   words
name  Маша   Вася  Эдуард
age     25      8      48